{
    "basic_info": {
      "description_header": "Creating Apps for caring life changers. By conscientious coding and aware communication.",
      "description": "👋 Hi! I'm David Matalik, a Web Developer loving to create modern React Apps. I ensure code quality through TDD and following SOLID principles. I strive daily to get better at coding and grow personally. 🚀 Fun Fact: Loving to experiment - eating kiwis with their skin (like an apple), sometimes also bananas (not like an apple 😀). Scroll down to learn more about me, my skills and accomplished projects!",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience",
        "recommendations": "Recommendations"
      }
    },
    "projects": [
      {
        "title": "Memory Training",
        "startDate": "2021",
        "description": "Memory Cards is a game that helps to train your memory. I used React with functional and styled components to create this game. I also learned more about the CSS grid property which helped to make the layout responsive.",
        "images": [
          "images/portfolio/memory-game/memory-896-504.png",
          "images/portfolio/memory-game/memory2-896-504.png"
        ],
        "url": "https://davidmatalik.github.io/memory-cards/",
        "technologies": [
          {
            "class": "devicon-react-plain",
            "name": "React"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS3"
          },
          {
            "class": "devicon-git-plain",
            "name": "Git"
          }
        ]
      },
      {
        "title": "Careship",
        "startDate": "2021",
        "description": "Careship is a non-violent variation of the popular game battleship. I used TDD (with Jest) the first time for the Careship game. To separate the view from the logic The PubSub pattern is used. I learned a lot about the drag and drop API as well as doing drag and drop with mouse events.",
        "images": [
          "images/portfolio/careship/careship-896-504.png",
          "images/portfolio/careship/careship2-896-504.png"
        ],
        "url": "https://davidmatalik.github.io/careship/",
        "technologies": [
          {
            "iconify": "jest",
            "name": "Jest"
          },
          {
            "class": "devicon-webpack-plain",
            "name": "Webpack"
          },
          {
            "class": "devicon-git-plain",
            "name": "Git"
          }
        ]
      },
      {
        "title": "Todo App",
        "startDate": "2021",
        "description": "I learned a lot about SOLID principles doing this Odin bootcamp project. I love to be organized (GTD rocks!). That is why with a friend developer I build an extended todo app - with Firebase background structure, and more functionality. We also created an UML diagramm for optimizing the architecture.",
        "images": [
          "images/portfolio/todo-app/todo-896-504.png",
          "images/portfolio/todo-app/todo2-896-504.png"
        ],
        "url": "https://davidmatalik.github.io/todo/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-webpack-plain",
            "name": "Webpack"
          },
          {
            "iconify": "logoNpm",
            "name": "Node P. M."
          }
        ]
      },
      {
        "title": "Weather App",
        "startDate": "2021",
        "description": "This project helped me to firm my understanding of APIs and asynchronous functions. With this weather app you can search for any city worldwide and get the current climate dates and appropriate weather icons.",
        "images": [
          "images/portfolio/weather-app/weather-896-504.png",
          "images/portfolio/weather-app/weather2-896-504.png"
        ],
        "url": "https://davidmatalik.github.io/weather-app/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "iconify": "api",
            "name": "App. Prog. Interface"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "The Odin bootcamp",
        "title": "Web Developer",
        "years": "06.2020 - present",
        "icon": "fab fa-js experience-icon",
        "mainTech": [
          "JavaScript"
        ],
        "technologies": [
          "JavaScript",
          "React",
          "Github",
          "Git",
          "Scrum",
          "Firebase",
          "Node",
          "NPM",
          "Mocha",
          "Jest",
          "Bootstrap",
          "Visual Studio Code",
          "HTML5",
          "CSS3",
          "Learning how to learn"
        ]
      },
      {
        "company": "Hewlett Packard GmbH in Böblingen",
        "title": "Student Business Informatics, Bachelor of Science",
        "years": "09.2009 - 09.2012",
        "icon": "fab fa-java experience-icon",
        "mainTech": [
          "Java"
        ],
        "technologies": [
          "Java",
          "Java Server Pages",
          "Eclipse",
          "Visual Basic",
          "Relational Databases",
          "UML",
          "JQuery",
          "HTML",
          "CSS",
          "Project Management",
          "Time Management"
        ]
      }
    ],
    "recommendations": [
      {
        "title": "Richard Steinmetz, Software Engineer at Devex",
        "text": "I've worked with David in different situations and settings and I must say that he is a remarkable engineer, learner and human being. Having pair programmed with him on a real-world challenge, I can tell that he really quickly gets into understanding the task at hand. He keeps an open mindset and guides the process with great thoughtful questions, even being new to a domain or technology! As David's coach I'm always amazed about his persistence and drive to solve problems and learn new things. He tackles every task conscientiously and with dedication. And while in the process, he never misses an opportunity to take active part in improving communication processes and give actionable honest feedback to make anything that you are working on another tad better. It's a real pleasure to work together with David and you'd be immensily happy to have him on board!",
        "image": "images/recommendation/richard-steinmetz.png"
      },
      {
        "title": "Christian Strozniak, Software Engineer at Awisto",
        "text": "I'm working with David on a plain javascript app. Both of us aim to get closer to the various aspects of programming in a playful way as a team. I really enjoy working with David. We hosted our project on github and we use all available possibilities to make progress with our project. Sprint planning and pull requests at our weekly meetings is a joy every time. David works very conscientiously and if I work sloppily from time to time, David notices it immediately and corrects me. My work benefits from that. I can talk shop with David until both of our heads are spinning. What I always find remarkable is how David keeps calm when things get complicated sometimes and we both notice that we are too entangled. Then somehow David always manages to look at things from a different point of view and to lead us to a basically simple solution. I met David a few years ago at a Vipassana course and was already enthusiastic about his honesty, his empathy and his constant interest in his counterpart. I'm really happy about the time to work with David in the team and I definitely don't want to miss it anymore when he comes up with the latest technologies or ideas.",
        "image": "images/recommendation/christian-strozniak.png"
      }
    ]
  }