{
    "basic_info": {
      "description_header": "Creating Apps for caring life changers. By conscientious coding and aware communication.",
      "description": "👋 Hi! I'm David Matalik, a Web Developer loving to create modern React Apps. I ensure code quality through TDD and following SOLID principles. I strive daily to get better at coding and grow personally. 🚀 Fun Fact: Loving to experiment - eating kiwis with their skin (like an apple), sometimes also bananas (not like an apple 😀). Scroll down to learn more about me, my skills and accomplished projects!",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience",
        "recommendations": "Recommendations"
      }
    },
    "projects": [
      {
        "title": "Careship",
        "startDate": "2021",
        "description": "Careship is a non-violent variation of the popular game battleship. I used TDD (with Jest) the first time for the Careship game. To separate the view from the logic The PubSub pattern is used. I learned a lot about the drag and drop API as well as doing drag and drop with mouse events.",
        "images": [
          "images/portfolio/careship/careship-896-504.png",
          "images/portfolio/careship/careship2-896-504.png"
        ],
        "url": "https://davidmatalik.github.io/careship/",
        "technologies": [
          {
            "iconify": "jest",
            "name": "Jest"
          },
          {
            "class": "devicon-webpack-plain",
            "name": "Webpack"
          },
          {
            "class": "devicon-git-plain",
            "name": "Git"
          }
        ]
      },
      {
        "title": "Todo App",
        "startDate": "2021",
        "description": "I learned a lot about SOLID principles doing this Odin bootcamp project. I love to be organized (GTD rocks!). That is why with a friend developer I build an extended todo app - with Firebase background structure, and more functionality. We also created an UML diagramm for optimizing the architecture.",
        "images": [
          "images/portfolio/todo-app/todo-896-504.png",
          "images/portfolio/todo-app/todo2-896-504.png"
        ],
        "url": "https://davidmatalik.github.io/todo/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-webpack-plain",
            "name": "Webpack"
          }
        ]
      },
      {
        "title": "Weather App",
        "startDate": "2021",
        "description": "This project helped me to firm my understanding of APIs and asynchronous functions. With this weather app you can search for any city worldwide and get the current climate dates and appropriate weather icons.",
        "images": [
          "images/portfolio/weather-app/weather-896-504.png",
          "images/portfolio/weather-app/weather2-896-504.png"
        ],
        "url": "https://davidmatalik.github.io/weather-app/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "iconify": "api",
            "name": "App. Prog. Interface"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "The Odin bootcamp",
        "title": "Web Developer",
        "years": "06.2020 - present",
        "icon": "fab fa-js experience-icon",
        "mainTech": [
          "JavaScript"
        ],
        "technologies": [
          "JavaScript",
          "React",
          "Github",
          "Git",
          "Scrum",
          "Firebase",
          "Node",
          "NPM",
          "Mocha",
          "Jest",
          "Bootstrap",
          "Visual Studio Code",
          "HTML5",
          "CSS3",
          "Learning how to learn"
        ]
      },
      {
        "company": "Hewlett Packard GmbH in Böblingen",
        "title": "Student Business Informatics, Bachelor of Science",
        "years": "09.2009 - 09.2012",
        "icon": "fab fa-java experience-icon",
        "mainTech": [
          "Java"
        ],
        "technologies": [
          "Java",
          "Java Server Pages",
          "Eclipse",
          "Visual Basic",
          "Relational Databases",
          "UML",
          "JQuery",
          "HTML",
          "CSS",
          "Project Management",
          "Time Management"
        ]
      }
    ],
    "recommendations": [
      {
        "title": "Richard Steinmetz, Software Engineer at Devex",
        "text": "I've worked with David in different situations and settings and I must say that he is a remarkable engineer, learner and human being. Having pair programmed with him on a real-world challenge, I can tell that he really quickly gets into understanding the task at hand. He keeps an open mindset and guides the process with great thoughtful questions, even being new to a domain or technology! As David's coach I'm always amazed about his persistence and drive to solve problems and learn new things. He tackles every task conscientiously and with dedication. And while in the process, he never misses an opportunity to take active part in improving communication processes and give actionable honest feedback to make anything that you are working on another tad better. It's a real pleasure to work together with David and you'd be immensily happy to have him on board!",
        "image": "images/recommendation/richard-steinmetz.png"
      },
      {
        "title": "Christian Strozniak, Software Engineer at Awisto",
        "text": "Ich arbeite mit David gemeinsam an einer plain javascript app. Unser beider Ziel ist es, spielerisch und im Team den verschiedenen Aspekten der Programmierung näher zukommen. Das Arbeiten mit David macht mir sehr viel Spass. Wir haben unser Projekt auf github gehostet und wir nutzen dort alle Möglichkeiten aus um unser Projekt voranzutreiben. Sprintplanung und Pull Requests bei unseren wöchentlichen Meetings ist jedes Mal eine Freude. David arbeitet da sehr gewissenhaft und sollte ich ab und an schlampig arbeiten, merkt es David sofort und korrigiert mich, was meiner Arbeit wiederrum zu gute kommt. Mit David kann ich fachsimpeln bis und beiden der Kopf raucht. Was ich dabei immer wieder bemerkenswert finde, ist, wie David die Ruhe bewart, wenn die Dinge manchmal kompliziert werden und wir beide merken, dass wir uns zu sehr verstrickt haben, dann schafft es David irgendiwe immer die Dinge aus einen anderen Blickwinkel zu betrachten und uns dann doch zu einer im Grunde simplen Lösung zu führen. Ich habe David vor ein paar Jahren bei einem Vipassana Kurs kennengelernt und war damals schon begeistert von seiner Ehrlichkeit, seinem Einfühlungsvermögen und seinem stetigen Interesse an seinem Gegenüber. Ich bin wirklich froh über die Zeit mit David im Team zu arbeiten und möchte es schon gar nicht mehr missen, wenn er mir mit den neusten Technologien oder Ideen um die Ecke kommt.",
        "image": "images/recommendation/christian-strozniak.png"
      }
    ]
  }