{
    "basic_info": {
      "description_header": "Apps erstellen für fürsorgliche Lebensverbesserer. Durch gewissenhaftes Programmieren und achtsame Kommunikation.",
      "description": "👋 Hi, ich bin David Matalik, Webentwickler. Ich liebe es moderne Apps mit React zu erstellen. Ich gewährleiste hohe Code-Qualität durch TDD und SOLID Prinzipien. Ich strebe täglich danach mein Programmierfertigkeiten zu verbessern und persönlich zu wachsen. 🚀 Einfach herunterscrollen, um mehr über mich, meine Fähigkeiten und abgeschlossene Projekte zu erfahren!",
      "section_name": {
        "about": "Über mich",
        "projects": "Projekte",
        "skills": "Fähigkeiten",
        "experience": "Erfahrungen",
        "recommendations": "Empfehlungen"
      }
    },
    "projects": [
      {
        "title": "Todo App",
        "startDate": "2021",
        "description": "Ich lernte eine Menge über SOLID Prinzipien während dieses Odin bootcamp Projektes. Ich liebe es organisiert zu sein (Ein Hoch auf GTD!). Deshalb baue ich auch gerade gemeinsam mit einem befreundetem Entwickler eine erweiterte Todo App - mit Firebase backend, und zusätzlicher Funktionalität. Um die Architektur zu verbessern, erstellten wir ein UML Diagramm. Zudem erarbeiteten wir agile Prozesse - speziell auf unser Projekt optimiert.",
        "images": [
          "images/portfolio/todo-app/todo-896-504.png",
          "images/portfolio/todo-app/todo2-896-504.png"
        ],
        "url": "https://davidmatalik.github.io/todo/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-webpack-plain",
            "name": "Webpack"
          }
        ]
      },
      {
        "title": "Wetter App",
        "startDate": "2021",
        "description": "Dieses Projekt half mir, mein Verständnis von APIs und asynchronen Funktionen zu vertiefen. Mit dieser Wetter App kann man nach jeder Stadt auf der Welt suchen und bekommt die aktuellen Wetterdaten mit passenden Wetter icons geliefert.",
        "images": [
          "images/portfolio/weather-app/weather-896-504.png",
          "images/portfolio/weather-app/weather2-896-504.png"
        ],
        "url": "https://davidmatalik.github.io/weather-app/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "name": "api"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "The Odin Project Bootcamp",
        "title": "Webentwickler",
        "years": "06.2020 - heute",
        "icon": "fab fa-js experience-icon",
        "mainTech": [
          "JavaScript"
        ],
        "technologies": [
          "JavaScript",
          "React",
          "Github",
          "Git",
          "Scrum",
          "Firebase",
          "Node",
          "NPM",
          "Mocha",
          "Jest",
          "Bootstrap",
          "Visual Studio Code",
          "HTML5",
          "CSS3",
          "Learning how to learn"
        ]
      },
      {
        "company": "Hewlett Packard GmbH in Böblingen",
        "title": "Wirtschaftsinformatik-Student, Abschluss Bachelor of Science",
        "years": "09.2009 - 09.2012",
        "icon": "fab fa-java experience-icon",
        "mainTech": [
          "Java"
        ],
        "technologies": [
          "Java",
          "Java Server Pages",
          "Eclipse",
          "Visual Basic",
          "Relationale Datenbanken",
          "UML",
          "JQuery",
          "HTML",
          "CSS",
          "Projekt-Management",
          "Zeit-Management"
        ]
      }
    ],
    "recommendations":
      {
        "title": "Richard Steinmetz, Softwareentwickler bei Devex",
        "text": "Ich arbeitete mit David in verschiedenen Situationen und Bereichen und muss sagen, dass er ein außergewöhnlicher Entwickler und Mensch ist. Da ich mit ihm an einer realen Herausforderung gearbeitet habe, kann ich sagen, dass er sehr schnell eine gerade anstehende Aufgabe versteht. Er behält eine offene Einstellung und treibt den Prozess mit wohlüberlegten Fragen voran, auch wenn der Bereich oder die Technologie neu für ihn ist! Als Davids Coach bin ich immer darüber erstaunt mit welcher Ausdauer und Energie er Probleme löst und neue Dinge lernt. Er  packt jede Aufgabe gewissenhaft und mit Hingabe an. Und in diesem Prozess lässt er keine Gelegenheit aus, um aktiv die Kommunikationgestaltung zu verbessern sowie ehrliches und konstruktives Feedback zu geben. Es ist eine wahre Freude mit David zusammen zu arbeiten und jedes Team kann sich ungeheuer glücklich schätzen ihn mit an Bord zu haben!",
        "image": "images/recommendation/richard-steinmetz.png"
      }
  }
  